test-plans/jmeter.log
2026-08-16 03:04:48,310 INFO o.a.j.u.JMeterUtils: Setting Locale to en_EN
2026-08-16 03:04:48,329 INFO o.a.j.JMeter: Loading user properties from: E:\apache-jmeter-5.6.3\bin\user.properties
2026-08-16 03:04:48,329 INFO o.a.j.JMeter: Loading system properties from: E:\apache-jmeter-5.6.3\bin\system.properties
2026-08-16 03:04:48,335 INFO o.a.j.JMeter: Copyright (c) 1998-2024 The Apache Software Foundation
2026-08-16 03:04:48,335 INFO o.a.j.JMeter: Version 5.6.3
2026-08-16 03:04:48,335 INFO o.a.j.JMeter: java.version=25.0.2
2026-08-16 03:04:48,335 INFO o.a.j.JMeter: java.vm.name=OpenJDK 64-Bit Server VM
2026-08-16 03:04:48,335 INFO o.a.j.JMeter: os.name=Windows 11
2026-08-16 03:04:48,335 INFO o.a.j.JMeter: os.arch=amd64
2026-08-16 03:04:48,335 INFO o.a.j.JMeter: os.version=10.0
2026-08-16 03:04:48,335 INFO o.a.j.JMeter: file.encoding=UTF-8
2026-08-16 03:04:48,335 INFO o.a.j.JMeter: java.awt.headless=true
2026-08-16 03:04:48,335 INFO o.a.j.JMeter: Max memory     =1073741824
2026-08-16 03:04:48,335 INFO o.a.j.JMeter: Available Processors =16
2026-08-16 03:04:48,345 INFO o.a.j.JMeter: Default Locale=English (EN)
2026-08-16 03:04:48,345 INFO o.a.j.JMeter: JMeter  Locale=English (EN)
2026-08-16 03:04:48,345 INFO o.a.j.JMeter: JMeterHome=E:\apache-jmeter-5.6.3
2026-08-16 03:04:48,345 INFO o.a.j.JMeter: user.dir  =E:\Testing_23CLC\HW5\eshop-sut\test-plans
2026-08-16 03:04:48,346 INFO o.a.j.JMeter: PWD       =E:\Testing_23CLC\HW5\eshop-sut\test-plans
2026-08-16 03:04:48,347 INFO o.a.j.JMeter: IP: 192.168.1.2 Name: DESKTOP-8BSPNE6 FullName: DESKTOP-8BSPNE6
2026-08-16 03:04:48,356 INFO o.a.j.s.FileServer: Default base='E:\Testing_23CLC\HW5\eshop-sut\test-plans'
2026-08-16 03:04:48,356 INFO o.a.j.s.FileServer: Set new base='E:\Testing_23CLC\HW5\eshop-sut\test-plans\.'
2026-08-16 03:04:48,543 INFO o.a.j.s.SaveService: Testplan (JMX) version: 2.2. Testlog (JTL) version: 2.2
2026-08-16 03:04:48,561 INFO o.a.j.s.SaveService: Using SaveService properties version 5.0
2026-08-16 03:04:48,564 INFO o.a.j.s.SaveService: Using SaveService properties file encoding UTF-8
2026-08-16 03:04:48,567 INFO o.a.j.s.SaveService: Loading file: .\23127158_Load_20260815.jmx
2026-08-16 03:04:48,610 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/html is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-08-16 03:04:48,610 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xhtml+xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-08-16 03:04:48,610 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-08-16 03:04:48,610 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-08-16 03:04:48,610 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/vnd.wap.wml is org.apache.jmeter.protocol.http.parser.RegexpHTMLParser
2026-08-16 03:04:48,610 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/css is org.apache.jmeter.protocol.http.parser.CssParser
2026-08-16 03:04:48,635 INFO o.a.j.JMeter: Creating summariser <summary>
2026-08-16 03:04:48,645 INFO o.a.j.e.StandardJMeterEngine: Running the test!
2026-08-16 03:04:48,645 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2026-08-16 03:04:48,645 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2026-08-16 03:04:48,649 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must contain the string: '.functions.'
2026-08-16 03:04:48,650 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must not contain the string: '.gui.'
2026-08-16 03:04:48,695 INFO o.a.j.r.ClassFinder: Will scan jar E:\apache-jmeter-5.6.3\lib\ext\jmeter-plugins-manager-1.12.jar with filter ExtendsClassFilter [parents=[interface org.apache.jmeter.functions.Function], inner=false, contains=null, notContains=null]. Consider exposing JMeter plugins via META-INF/services, and add JMeter-Skip-Class-Scanning=true manifest attribute so JMeter can skip classfile scanning
2026-08-16 03:04:48,762 INFO o.a.j.r.ClassFinder: Will scan jar E:\apache-jmeter-5.6.3\lib\ext\jmeter-plugins-casutg-3.1.1.jar with filter ExtendsClassFilter [parents=[interface org.apache.jmeter.functions.Function], inner=false, contains=null, notContains=null]. Consider exposing JMeter plugins via META-INF/services, and add JMeter-Skip-Class-Scanning=true manifest attribute so JMeter can skip classfile scanning
2026-08-16 03:04:48,780 INFO o.a.j.JMeter: Running test (1786824288780)
2026-08-16 03:04:48,794 INFO o.a.j.e.StandardJMeterEngine: Starting ThreadGroup: 1 : Ultimate Thread Group - Load - Buy-then-history - 10 users
2026-08-16 03:04:48,794 INFO o.a.j.e.StandardJMeterEngine: Starting 10 threads for group Ultimate Thread Group - Load - Buy-then-history - 10 users.
2026-08-16 03:04:48,794 INFO o.a.j.e.StandardJMeterEngine: Thread will continue on error
2026-08-16 03:04:48,794 INFO k.a.j.t.AbstractSimpleThreadGroup: Starting thread group number 1 threads 10
2026-08-16 03:04:48,806 INFO k.a.j.t.AbstractSimpleThreadGroup: Started thread group number 1
2026-08-16 03:04:48,806 INFO o.a.j.e.StandardJMeterEngine: All thread groups have been started
2026-08-16 03:04:54,795 INFO o.a.j.t.JMeterThread: Thread started: Ultimate Thread Group - Load - Buy-then-history - 10 users 1-10
2026-08-16 03:04:54,796 INFO o.a.j.s.FileServer: Stored: E:/Testing_23CLC/HW5/eshop-sut/data/checkout_inputs.csv
2026-08-16 03:04:54,803 INFO o.a.j.s.FileServer: Stored: E:/Testing_23CLC/HW5/eshop-sut/data/product_inputs.csv
2026-08-16 03:04:54,804 INFO o.a.j.s.FileServer: Stored: E:/Testing_23CLC/HW5/eshop-sut/data/load_auth_users.csv
2026-08-16 03:04:57,068 INFO o.a.j.p.h.s.HTTPHCAbstractImpl: Local host = DESKTOP-8BSPNE6
2026-08-16 03:04:57,074 INFO o.a.j.p.h.s.HTTPHC4Impl: HTTP request retry count = 0
2026-08-16 03:04:57,075 INFO o.a.j.s.SampleResult: Note: Sample TimeStamps are START times
2026-08-16 03:04:57,075 INFO o.a.j.s.SampleResult: sampleresult.default.encoding is set to UTF-8
2026-08-16 03:04:57,075 INFO o.a.j.s.SampleResult: sampleresult.useNanoTime=true
2026-08-16 03:04:57,075 INFO o.a.j.s.SampleResult: sampleresult.nanoThreadSleep=5000
2026-08-16 03:05:00,097 INFO o.a.j.r.Summariser: summary +      2 in 00:00:11 =    0.2/s Avg:    13 Min:     2 Max:    25 Err:     0 (0.00%) Active: 1 Started: 1 Finished: 0
2026-08-16 03:05:00,795 INFO o.a.j.t.JMeterThread: Thread started: Ultimate Thread Group - Load - Buy-then-history - 10 users 1-9
2026-08-16 03:05:06,795 INFO o.a.j.t.JMeterThread: Thread started: Ultimate Thread Group - Load - Buy-then-history - 10 users 1-8
2026-08-16 03:05:08,962 INFO o.a.j.u.JsseSSLManager: Using default SSL protocol: TLS
2026-08-16 03:05:08,962 INFO o.a.j.u.JsseSSLManager: SSL session context: per-thread
2026-08-16 03:05:12,794 INFO o.a.j.t.JMeterThread: Thread started: Ultimate Thread Group - Load - Buy-then-history - 10 users 1-7
2026-08-16 03:05:18,796 INFO o.a.j.t.JMeterThread: Thread started: Ultimate Thread Group - Load - Buy-then-history - 10 users 1-6
2026-08-16 03:05:24,794 INFO o.a.j.t.JMeterThread: Thread started: Ultimate Thread Group - Load - Buy-then-history - 10 users 1-5
2026-08-16 03:05:30,111 INFO o.a.j.r.Summariser: summary +     57 in 00:00:30 =    1.9/s Avg:     3 Min:     1 Max:    10 Err:     0 (0.00%) Active: 6 Started: 6 Finished: 0
2026-08-16 03:05:30,111 INFO o.a.j.r.Summariser: summary =     59 in 00:00:41 =    1.4/s Avg:     3 Min:     1 Max:    25 Err:     0 (0.00%)
2026-08-16 03:05:30,796 INFO o.a.j.t.JMeterThread: Thread started: Ultimate Thread Group - Load - Buy-then-history - 10 users 1-4
2026-08-16 03:05:36,794 INFO o.a.j.t.JMeterThread: Thread started: Ultimate Thread Group - Load - Buy-then-history - 10 users 1-3
2026-08-16 03:05:42,795 INFO o.a.j.t.JMeterThread: Thread started: Ultimate Thread Group - Load - Buy-then-history - 10 users 1-2
2026-08-16 03:05:48,795 INFO o.a.j.t.JMeterThread: Thread started: Ultimate Thread Group - Load - Buy-then-history - 10 users 1-1
2026-08-16 03:06:00,079 INFO o.a.j.r.Summariser: summary +    128 in 00:00:30 =    4.3/s Avg:     3 Min:     1 Max:    10 Err:     0 (0.00%) Active: 10 Started: 10 Finished: 0
2026-08-16 03:06:00,079 INFO o.a.j.r.Summariser: summary =    187 in 00:01:11 =    2.6/s Avg:     3 Min:     1 Max:    25 Err:     0 (0.00%)
2026-08-16 03:06:30,040 INFO o.a.j.r.Summariser: summary +    147 in 00:00:30 =    4.9/s Avg:     3 Min:     1 Max:    11 Err:     0 (0.00%) Active: 10 Started: 10 Finished: 0
2026-08-16 03:06:30,041 INFO o.a.j.r.Summariser: summary =    334 in 00:01:41 =    3.3/s Avg:     3 Min:     1 Max:    25 Err:     0 (0.00%)
2026-08-16 03:07:00,008 INFO o.a.j.r.Summariser: summary +    154 in 00:00:30 =    5.1/s Avg:     2 Min:     1 Max:    11 Err:     0 (0.00%) Active: 10 Started: 10 Finished: 0
2026-08-16 03:07:00,008 INFO o.a.j.r.Summariser: summary =    488 in 00:02:11 =    3.7/s Avg:     3 Min:     1 Max:    25 Err:     0 (0.00%)
2026-08-16 03:07:30,124 INFO o.a.j.r.Summariser: summary +    145 in 00:00:30 =    4.8/s Avg:     2 Min:     1 Max:     9 Err:     0 (0.00%) Active: 10 Started: 10 Finished: 0
2026-08-16 03:07:30,124 INFO o.a.j.r.Summariser: summary =    633 in 00:02:41 =    3.9/s Avg:     2 Min:     1 Max:    25 Err:     0 (0.00%)
2026-08-16 03:08:00,120 INFO o.a.j.r.Summariser: summary +    147 in 00:00:30 =    4.9/s Avg:     3 Min:     1 Max:    11 Err:     0 (0.00%) Active: 10 Started: 10 Finished: 0
2026-08-16 03:08:00,121 INFO o.a.j.r.Summariser: summary =    780 in 00:03:11 =    4.1/s Avg:     3 Min:     1 Max:    25 Err:     0 (0.00%)
2026-08-16 03:08:30,556 INFO o.a.j.r.Summariser: summary +    151 in 00:00:30 =    5.0/s Avg:     3 Min:     1 Max:    68 Err:     0 (0.00%) Active: 10 Started: 10 Finished: 0
2026-08-16 03:08:30,556 INFO o.a.j.r.Summariser: summary =    931 in 00:03:42 =    4.2/s Avg:     3 Min:     1 Max:    68 Err:     0 (0.00%)
2026-08-16 03:09:00,209 INFO o.a.j.r.Summariser: summary +    153 in 00:00:30 =    5.2/s Avg:     2 Min:     1 Max:     9 Err:     0 (0.00%) Active: 10 Started: 10 Finished: 0
2026-08-16 03:09:00,209 INFO o.a.j.r.Summariser: summary =   1084 in 00:04:11 =    4.3/s Avg:     3 Min:     1 Max:    68 Err:     0 (0.00%)
2026-08-16 03:09:30,216 INFO o.a.j.r.Summariser: summary +    150 in 00:00:30 =    5.0/s Avg:     3 Min:     1 Max:   164 Err:     0 (0.00%) Active: 10 Started: 10 Finished: 0
2026-08-16 03:09:30,216 INFO o.a.j.r.Summariser: summary =   1234 in 00:04:41 =    4.4/s Avg:     3 Min:     1 Max:   164 Err:     0 (0.00%)
2026-08-16 03:10:00,192 INFO o.a.j.r.Summariser: summary +    149 in 00:00:30 =    5.0/s Avg:     2 Min:     1 Max:    10 Err:     0 (0.00%) Active: 10 Started: 10 Finished: 0
2026-08-16 03:10:00,192 INFO o.a.j.r.Summariser: summary =   1383 in 00:05:11 =    4.4/s Avg:     3 Min:     1 Max:   164 Err:     0 (0.00%)
2026-08-16 03:10:30,155 INFO o.a.j.r.Summariser: summary +    151 in 00:00:30 =    5.0/s Avg:     2 Min:     1 Max:     9 Err:     0 (0.00%) Active: 10 Started: 10 Finished: 0
2026-08-16 03:10:30,155 INFO o.a.j.r.Summariser: summary =   1534 in 00:05:41 =    4.5/s Avg:     3 Min:     1 Max:   164 Err:     0 (0.00%)
2026-08-16 03:10:50,513 INFO o.a.j.t.JMeterThread: Thread finished: Ultimate Thread Group - Load - Buy-then-history - 10 users 1-10
2026-08-16 03:10:54,310 INFO o.a.j.t.JMeterThread: Thread finished: Ultimate Thread Group - Load - Buy-then-history - 10 users 1-9
2026-08-16 03:10:56,894 INFO o.a.j.t.JMeterThread: Thread finished: Ultimate Thread Group - Load - Buy-then-history - 10 users 1-8
2026-08-16 03:10:59,462 INFO o.a.j.t.JMeterThread: Thread finished: Ultimate Thread Group - Load - Buy-then-history - 10 users 1-7
2026-08-16 03:11:00,073 INFO o.a.j.r.Summariser: summary +    142 in 00:00:30 =    4.7/s Avg:     2 Min:     0 Max:    11 Err:     0 (0.00%) Active: 6 Started: 10 Finished: 4
2026-08-16 03:11:00,073 INFO o.a.j.r.Summariser: summary =   1676 in 00:06:11 =    4.5/s Avg:     3 Min:     0 Max:   164 Err:     0 (0.00%)
2026-08-16 03:11:03,059 INFO o.a.j.t.JMeterThread: Thread finished: Ultimate Thread Group - Load - Buy-then-history - 10 users 1-6
2026-08-16 03:11:05,783 INFO o.a.j.t.JMeterThread: Thread finished: Ultimate Thread Group - Load - Buy-then-history - 10 users 1-5
2026-08-16 03:11:07,497 INFO o.a.j.t.JMeterThread: Thread finished: Ultimate Thread Group - Load - Buy-then-history - 10 users 1-4
2026-08-16 03:11:10,481 INFO o.a.j.t.JMeterThread: Thread finished: Ultimate Thread Group - Load - Buy-then-history - 10 users 1-3
2026-08-16 03:11:15,601 INFO o.a.j.t.JMeterThread: Thread finished: Ultimate Thread Group - Load - Buy-then-history - 10 users 1-2
2026-08-16 03:11:18,469 INFO o.a.j.t.JMeterThread: Thread finished: Ultimate Thread Group - Load - Buy-then-history - 10 users 1-1
2026-08-16 03:11:18,469 INFO o.a.j.e.StandardJMeterEngine: Notifying test listeners of end of test
2026-08-16 03:11:18,469 INFO o.a.j.s.FileServer: Close: E:/Testing_23CLC/HW5/eshop-sut/data/product_inputs.csv
2026-08-16 03:11:18,469 INFO o.a.j.s.FileServer: Close: E:/Testing_23CLC/HW5/eshop-sut/data/load_auth_users.csv
2026-08-16 03:11:18,469 INFO o.a.j.s.FileServer: Close: E:/Testing_23CLC/HW5/eshop-sut/data/checkout_inputs.csv
2026-08-16 03:11:18,470 INFO o.a.j.r.Summariser: summary +     33 in 00:00:18 =    1.8/s Avg:     2 Min:     1 Max:     9 Err:     0 (0.00%) Active: 0 Started: 10 Finished: 10
2026-08-16 03:11:18,470 INFO o.a.j.r.Summariser: summary =   1709 in 00:06:30 =    4.4/s Avg:     3 Min:     0 Max:   164 Err:     0 (0.00%)